In [1]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

In [2]:
 s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
s[2]

5.0

In [9]:
s[0:3]

0    1.0
1    3.0
2    5.0
dtype: float64

In [17]:
#First 6 days of Jan in 2018
dates = pd.date_range('20180101', periods=6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2018-01-01 -0.809239 -1.692992 -0.409116  0.844488
2018-01-02 -0.232975  2.604531 -1.603866  0.157302
2018-01-03  0.658878  0.004422 -1.653419 -0.311386
2018-01-04 -0.014598 -1.463370  0.103816 -0.966924
2018-01-05 -1.432275 -0.765598  0.277809 -1.434052
2018-01-06 -1.999006  0.534495  0.177371  0.315721

In [25]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.

df2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [27]:
df.head()

                   A         B         C         D
2018-01-01 -0.809239 -1.692992 -0.409116  0.844488
2018-01-02 -0.232975  2.604531 -1.603866  0.157302
2018-01-03  0.658878  0.004422 -1.653419 -0.311386
2018-01-04 -0.014598 -1.463370  0.103816 -0.966924
2018-01-05 -1.432275 -0.765598  0.277809 -1.434052

In [28]:
df.tail()

                   A         B         C         D
2018-01-02 -0.232975  2.604531 -1.603866  0.157302
2018-01-03  0.658878  0.004422 -1.653419 -0.311386
2018-01-04 -0.014598 -1.463370  0.103816 -0.966924
2018-01-05 -1.432275 -0.765598  0.277809 -1.434052
2018-01-06 -1.999006  0.534495  0.177371  0.315721

In [30]:
# Display the index,columns, and the underlying numpy data
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
df.values

array([[-0.80923918, -1.69299236, -0.40911579,  0.84448809],
       [-0.23297493,  2.60453072, -1.6038656 ,  0.1573021 ],
       [ 0.65887847,  0.00442181, -1.65341943, -0.31138635],
       [-0.01459825, -1.46337032,  0.10381616, -0.96692384],
       [-1.43227469, -0.76559772,  0.27780916, -1.4340524 ],
       [-1.99900602,  0.53449507,  0.17737148,  0.31572113]])

In [33]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.638202 -0.129752 -0.517901 -0.232475
std    0.974382  1.585061  0.892597  0.848731
min   -1.999006 -1.692992 -1.653419 -1.434052
25%   -1.276516 -1.288927 -1.305178 -0.803039
50%   -0.521107 -0.380588 -0.152650 -0.077042
75%   -0.069192  0.401977  0.158983  0.276116
max    0.658878  2.604531  0.277809  0.844488

In [34]:
# Transposing your data
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.809239   -0.232975    0.658878   -0.014598   -1.432275   -1.999006
B   -1.692992    2.604531    0.004422   -1.463370   -0.765598    0.534495
C   -0.409116   -1.603866   -1.653419    0.103816    0.277809    0.177371
D    0.844488    0.157302   -0.311386   -0.966924   -1.434052    0.315721

In [39]:
# sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01  0.844488 -0.409116 -1.692992 -0.809239
2018-01-02  0.157302 -1.603866  2.604531 -0.232975
2018-01-03 -0.311386 -1.653419  0.004422  0.658878
2018-01-04 -0.966924  0.103816 -1.463370 -0.014598
2018-01-05 -1.434052  0.277809 -0.765598 -1.432275
2018-01-06  0.315721  0.177371  0.534495 -1.999006

In [41]:
df.A

2018-01-01   -0.809239
2018-01-02   -0.232975
2018-01-03    0.658878
2018-01-04   -0.014598
2018-01-05   -1.432275
2018-01-06   -1.999006
Freq: D, Name: A, dtype: float64

In [42]:
# Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2018-01-01   -0.809239
2018-01-02   -0.232975
2018-01-03    0.658878
2018-01-04   -0.014598
2018-01-05   -1.432275
2018-01-06   -1.999006
Freq: D, Name: A, dtype: float64

In [43]:
# slice by row
df[0:2]

                   A         B         C         D
2018-01-01 -0.809239 -1.692992 -0.409116  0.844488
2018-01-02 -0.232975  2.604531 -1.603866  0.157302

In [44]:
# finding a cross section using a label
df.loc[dates[0]]

A   -0.809239
B   -1.692992
C   -0.409116
D    0.844488
Name: 2018-01-01 00:00:00, dtype: float64

In [45]:
# Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2018-01-01 -0.809239 -1.692992
2018-01-02 -0.232975  2.604531
2018-01-03  0.658878  0.004422
2018-01-04 -0.014598 -1.463370
2018-01-05 -1.432275 -0.765598
2018-01-06 -1.999006  0.534495

In [47]:
# Select via the position of the passed integers
df.iloc[3]

A   -0.014598
B   -1.463370
C    0.103816
D   -0.966924
Name: 2018-01-04 00:00:00, dtype: float64

In [48]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[3:5,0:2]

                   A         B
2018-01-04 -0.014598 -1.463370
2018-01-05 -1.432275 -0.765598